<!-- dflook/terraform-github-actions {"workspace":"staging","backend_type":"local","backend":"6055be4958a2dcc81915f8dc3e10b50bbba953085798a4184ea13278d7f9b1eb","plan_job_ref":"Job CI #11 at https://github.com/jacobscunn07/terraform-workflows-poc/actions/runs/5594366457","plan_hash":"904d59ece7bec7dc499e7e66480cf46a8afd8797a46ddf7d81393d92914e9117","plan_text_format":"text","version":"1.36.1"} -->
Terraform plan in __.__ in the __staging__ workspace
With var files: `staging.tfvars
`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.foo will be created
  + resource "local_file" "foo" {
      + content              = "staging Hola!"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./foo.bar"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Release #33](https://github.com/jacobscunn07/terraform-workflows-poc/actions/runs/5594380521)